doc/ox-hugo-manual.org
#+TITLE: Ox-Hugo Manual
#+AUTHOR: Kaushal Modi

#+HUGO_BASE_DIR: .
#+HUGO_SECTION: doc

#+MACRO: imageclick [[file:./static/images/$1][file:/images/$1]]
#+MACRO: issue [[[https://github.com/kaushalmodi/ox-hugo/issues/$1][$1]]]

*** Do I need to re-write my whole blog in Org?
:PROPERTIES:
:EXPORT_FILE_NAME: do-I-need-to-re-write-my-whole-blog-in-org
:END:
If you are considering to try out =ox-hugo=, and if you have already
been using Hugo, it is normal for this thought to cross your mind:
#+BEGIN_QUOTE
I already have dozens or hundreds of posts written in Markdown. Do I
need to convert them to Org if I want to start using =ox-hugo=?
#+END_QUOTE

The answer is *No*.

This package will export your future posts written in Org to
Markdown. And those files will live along with your already written
Markdown posts. So converting existing Markdown files to Org would be
purely the user's choice, your choice -- but that's by no means a
necessity if you want to start using =ox-hugo=.

.. And if at some point, you want to stop using =ox-hugo=, you still
have the exported Markdown files.
