doc/content/doc/do-I-need-to-re-write-my-whole-blog-in-org.md
+++
title = "Do I need to re-write my whole blog in Org?"
draft = false
[menu."early_questions"]
  weight = 3002
  identifier = "do-i-need-to-re-write-my-whole-blog-in-org"
+++

If you are considering to try out `ox-hugo`, and if you have already
been using Hugo, it is normal for this thought to cross your mind:

> I already have dozens or hundreds of posts written in Markdown. Do I
> need to convert them to Org if I want to start using `ox-hugo`?

The answer is **No**.

This package will export your future posts written in Org to
Markdown. And those files will live along with your already written
Markdown posts. So converting existing Markdown files to Org would be
purely the user's choice, your choice -- but that's by no means a
necessity if you want to start using `ox-hugo`.

.. And if at some point, you want to stop using `ox-hugo`, you still
have the exported Markdown files.
